package Model.InvestmentDecision;

public class Stock {

    private final String name = Stocks.MangGuoChaoMei.name(), industry = Industries.ChuanMei.name();

    public String getName() {
        return name;
    }
    public String getIndustry() {
        return industry;
    }

    /*
        全部股票：
        食品饮料：中炬高新、骑士乳业、盖世食品、双汇发展、伊利股份、金龙鱼
        医疗器械：华大智造、安图生物
        通信设备：海能达
        文化传媒：紫天科技、芒果超媒
        游戏：盛天网络
        生物制品：万泰生物、通化东宝、智飞生物、凯因科技、沃森生物
        医疗服务：药明康德
        互联网服务：昆仑万维

        成交额逐日递增（过去五个交易日）：
        注：没有的股票则没有每天都递增
        食品饮料：骑士乳业、盖世食品、双汇发展、伊利股份、金龙鱼
        文化传媒：芒果超媒
        生物制品：万泰生物、通化东宝、沃森生物

        主力净买入（正）：
        注：没有的股票则为负
        食品饮料：中炬高新、双汇发展、金龙鱼
        医疗器械：华大智造
        通信设备：海能达
        文化传媒：紫天科技
        游戏：盛天网络
        生物制品：智飞生物、沃森生物
        医疗服务：药明康德
        互联网服务：昆仑万维

        市净率：
        食品饮料：中炬高新（3.93）、骑士乳业（1.88）、盖世食品（3.57）、双汇发展（4.53）、伊利股份（3.49）、金龙鱼（2.09）
        医疗器械：华大智造（2.59）、安图生物（3.38）
        通信设备：海能达（2.02）
        文化传媒：紫天科技（2.37）、芒果超媒（2.21）
        游戏：盛天网络（3.39）
        生物制品：万泰生物（8.25）、通化东宝（2.68）、智飞生物（2.53）、凯因科技（2.75）、沃森生物（2.48）
        医疗服务：药明康德（2.79）
        互联网服务：昆仑万维（3.06）

        总股本/流通市值/市值（亿）：
        食品饮料：中炬高新（7.83/179.87/182.73）、骑士乳业（2.09/6.56/14.36）、盖世食品（1.41/5.10/11.49）、双汇发展（34.65/938.43/938.58）、伊利股份（63.66/1832.89/1850.59）、金龙鱼（54.22/192.59/1924.12）
        医疗器械：华大智造（4.16/108.57/211.93）、安图生物（5.81/279.82/279.82）
        通信设备：海能达（18.18/85.53/121.27）
        文化传媒：紫天科技（1.62/28.89/29.17）、芒果超媒（18.71/268.91/492.37）
        游戏：盛天网络（4.91/46.8/57.63）
        生物制品：万泰生物（12.65/1035.76/1035.76）、通化东宝（19.82/173.8/173.8）、智飞生物（23.94/472.1/799.05）、凯因科技（1.71/48.22/48.22）、沃森生物（15.99/229.52/235.42）
        医疗服务：药明康德（29.12/1322.01/1524.69）
        互联网服务：昆仑万维（12.31/462.43/462.43）

        每股盈利：
        食品饮料：中炬高新（0.447）、骑士乳业（0.17）、盖世食品（0.14）、双汇发展（0.6628）、伊利股份（1.183）、金龙鱼（0.2）
        医疗器械：华大智造（-0.72）、安图生物（1.0663）
        通信设备：海能达（0.0893）
        文化传媒：紫天科技（0.073）、芒果超媒（0.57）
        游戏：盛天网络（0.0083）
        生物制品：万泰生物（0.2059）、通化东宝（-0.12）、智飞生物（0.9322）、凯因科技（0.25）、沃森生物（0.1066）
        医疗服务：药明康德（1.46）
        互联网服务：昆仑万维（-0.32）

        委比：
        食品饮料：中炬高新（-85.27）、骑士乳业（-59.83）、盖世食品（-56.53）、双汇发展（61.2）、伊利股份（53.42）、金龙鱼（-53.86）
        医疗器械：华大智造（12.02）、安图生物（-76.95）
        通信设备：海能达（100）
        文化传媒：紫天科技（56.36）、芒果超媒（90.44）
        游戏：盛天网络（-36.13）
        生物制品：万泰生物（7.73）、通化东宝（-8.93）、智飞生物（100）、凯因科技（42.77）、沃森生物（100）
        医疗服务：药明康德（100）
        互联网服务：昆仑万维（23.66）

        外盘大于内盘：
        注：没有的股票则内盘大于外盘
        食品饮料：中炬高新、骑士乳业、盖世食品、双汇发展、伊利股份、金龙鱼
        医疗器械：华大智造、安图生物
        通信设备：海能达
        文化传媒：紫天科技、芒果超媒
        游戏：盛天网络
        生物制品：万泰生物、通化东宝、智飞生物、凯因科技、沃森生物
        互联网服务：昆仑万维

        主力成交占比：
        食品饮料：中炬高新（49）、骑士乳业（无）、盖世食品（无）、双汇发展（35）、伊利股份（60）、金龙鱼（59）
        医疗器械：华大智造（22）、安图生物（41）
        通信设备：海能达（60）
        文化传媒：紫天科技（41）、芒果超媒（59）
        游戏：盛天网络（46）
        生物制品：万泰生物（54）、通化东宝（43）、智飞生物（68）、凯因科技（45）、沃森生物（59）
        医疗服务：药明康德（75）
        互联网服务：昆仑万维（70）
     */

    /*
        09/03/2022 opening
        29/03/2022 +50
        29/03/2022 +150
        01/04/2022 +100
        19/04/2022 -150
        03/05/2022 +100
        01/06/2022 +100
        01/07/2022 +100
        01/08/2022 +100
        01/09/2022 +100
        03/10/2022 +100
        01/11/2022 +100
        01/12/2022 +100
        03/01/2023 +100
        01/02/2023 +100
        01/03/2023 +100
        03/04/2023 +100
        02/05/2023 +100
        01/06/2023 +100
        03/07/2023 +100
        01/08/2023 +100
        01/09/2023 +100
        02/10/2023 +100
        01/11/2023 +100
        01/12/2023 +100
        20/12/2023 +95.61
        21/12/2023 -95.61
        02/01/2024 +100
        01/02/2024 +100
        22/02/2024 +89.66
        22/02/2024 -89.66
        01/03/2024 +100
        02/04/2024 +100
        01/05/2024 +100
        03/06/2024 +100
        ../07/2024 +100
        ../08/2024 +100
        ../09/2024 +100
        ../10/2024 +100

     */

}
